In [1]:
import pandas as pd
import numpy as np
#Store data
state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}

#Read as dataframe + Display
state = pd.DataFrame(state_data, columns=['State','PostCode','Area','Pop'])
state

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2   Arizona       AZ        *  3,665,228
3  Arkansas       AR   53,182  2,350,750

In [2]:
#Set State as index
state = state.set_index('State')
state

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        *  3,665,228
Arkansas       AR   53,182  2,350,750

In [3]:
#Replace the '*' with '0'.
state.replace('*','0', inplace = True)
state

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        0  3,665,228
Arkansas       AR   53,182  2,350,750

In [6]:
#Define a function to replace ',' with ''.
def replace_commas(x):
    try:
        return x.replace(',', '')
    except:
        print('Error')
    
state['Area'] = state['Area'].map(replace_commas)
state['Pop'] = state['Pop'].map(replace_commas)
state

         PostCode    Area      Pop
State
Alabama        AL   52423  4040587
Alaska         AK  656424   550043
Arizona        AZ       0  3665228
Arkansas       AR   53182  2350750